ARABICFLASH_CARDS = {
	"رائع" => "مصطلح بالعامية  يستخدم لوصف شيء  رائع",
	" تسكع" => "قضاء وقت مع الأصدقاء",
	"to sit tight" => "to wait patiently ",
	"to be under the weather" => "الإحساس بالتعب أو عدم الراحة",
	"to ring a bell" => "يذكرك بأمر مألوف",
	"to be bummed" => "مضطرب",
	"to take a rain check" => "تأجيل أمر لوقت أخر",
	"طرد" => "أن يتم طردك من وظيفتك",
	"تخطي شيء ما" => "عدم الإكتراث بشيء بعد الأن",
	"rule of thumb" => "قاعدة شخصية أو شيء للتذكر",
	"دعم" => "الإنتباه على شخص ما",
	"to get back on your feet" => "إستعادة وضعك الجيد بعد مرحلة سيئة",
	"إحتيال" => "الإحتيال على شخص وخداعه في تبادل غير عادل",
	"a piece of cake" => "لوصف مهمة أو نشاط سهل أو بسيط",
	"once in a blue moon" => "لوصف شيء يحدث نادرا جدا",
	"بإختصار " => "للقول أنك سوف تختصر، أنك لن تعطي التفاصيل المملة",
	"عصفوران بحجر واحد" => "تحقيق شيئين مختلفين في نفس الوقت",
	"jump on the bandwagon" => "الإنضمام إلى نشاط شائع",
	"hit the hay" => "الذهب إلى السرير/النوم"
}

def random_arabicflashcard_name
	ARABICFLASH_CARDS.to_a.sample[0]
end
